[
  {
    "path": "posts/2021-08-09-asymsam/",
    "title": "Sources and impacts of the zonally asymmetric component of the Southern Annular Mode",
    "description": "Explanation of our recent paper on asymmetric and symmetric parts of the Southern Annular Mode.",
    "author": [
      {
        "name": "Elio Campitelli",
        "url": "https://eliocamp.github.io/"
      }
    ],
    "date": "2021-08-10",
    "categories": [
      "SAM",
      "ENSO",
      "general circulation"
    ],
    "contents": "\nToday I got my first paper published! 🎉\nAlong with my PhD advisors, Leandro Díaz and Carolina Vera, we wrote “Assessment of zonally symmetric and asymmetric components of the Southern Annular Mode using a novel approach” (because it wouldn’t be an academic publication if the title was shorter), and this post is a general explanation of the main methods and takeaways of the paper.\nWhat’s the deal with the SAM\nClimatologists love to think of the climate as a series of different modes. That is, take all the incomprehensible complexity of the evolving climate and distil it to a handful of phenomena that we can understand. For example, instead of having to think about all the variability of the Equatorial Pacific Ocean, which is a 3D field with multiple variables, you can think about the El Niño–Southern Oscillation (ENSO) phenomenon, which can be characterised by a single time series. Other members of the “Climate Oscillations Hall of Fame,” and their respective acronyms, are the Indian Ocean Dipole (IOD), the Northern Annular Mode (NAM), the North Atlantic Oscillation (NAO) and, important for this paper, the Southern Annular Mode (SAM).\nThe SAM describes an oscillating pattern of alternating low and high pressure anomalies over Antarctica and in the middle latitudes. To have a clear picture, the typical field of pressure anomalies when the SAM is on it’s positive phase looks like Figure 1.\n\n\n\n\nFigure 1: Typical pressure anomalies of the positive phase of the SAM. Lower pressure than usual over the Antarctic and higher pressure than usual in the mid-latitudes.\n\n\n\nAs you can see, this pattern lives up to its name in that the positive pressure anomalies form a ring (or, for the hoity-toity scientists, an annulus) around the negative pressure anomalies. In fact, almost every paper on the topic starts the introduction with a sentence along the lines of “The SAM is approximately zonally symmetric…” (Fogt and Marshall 2020) –where “zonally symmetric” means that it doesn’t depend on longitude. The word “approximately” is doing a lot of heavy lifting: the zonally symmetric ring is clearly deformed by zonally asymmetric anomalies.\nMost papers basically ignore these deviations from zonal symmetry and think of the SAM as zonally symmetric. This is fine as a first order approximation, but many aspects of the SAM are actually tied to its asymmetric nature. For example, the SAM is associated with anomalies in meridional (north–south) wind, which is not possible for a zonally symmetric pattern. And these meridional wind anomalies clearly are related to impacts in precipitation in over South America (Silvestri and Vera 2009) and temperature over the Antarctic Peninsula (Fogt, Jones, and Renwick 2012). These anomalies are also conspicuously similar to the effect of ENSO on these higher latitudes (e.g. Clem and Fogt 2013).\nThe understanding of the SAM as zonally symmetric also influences the theories behind the positive trend of the SAM index seen during the austral summer. Simulations show that increased concentrations of greenhouse gases and changes in stratospheric ozone combine to produce a zonally symmetric change of lower pressures over the poles and higher pressures at lower latitudes (Figure 2 from Arblaster and Meehl (2006)). Since these changes are similar to the positive phase of the SAM, then it’s only logical to identify this simulated changes with the observed SAM trend. But, of course, this only works for a zonally symmetric SAM.\n\n\n\n\nFigure 2: Trends in sea level pressure for the 1958–1999 period simulated with climate models that include various forcings. From Arblaster and Meehl (2006).\n\n\n\nIn essence, all evidence point to the fact that the asymmetric part of the SAM can have different sources of variability, different impacts, and different trends. So what we wanted to do is to try to separate the SAM into two indices, and index for the symmetric part of the SAM, and another for the asymmetric part of the SAM. The hope being that by studying these indices we could understand better the relationships between other parts of the climate to each part of the SAM.\nHow to divide the SAM\nWhat we did was, for each vertical level, to take the classical SAM pattern that we all know and love (Fig. 3a) and create two derived fields. The zonal mean field, which represents the zonally symmetric SAM (Fig. 3c) and then the difference between the full SAM field and the zonal mean, which represents the zonally asymmetric SAM (Fig. 3b). This figure really shows that the magnitude of the zonal anomalies is on par with the magnitude of the zonal mean!\n\n\n\n\nFigure 3: Spatial patterns of the first EOF of 700\\ hPa geopotential height for 1979 – 2018 period. (a) Full field, (b) zonally asymmetric component and (c) zonally symmetric component. Arbitrary units; positive values in blue and negative values in red.\n\n\n\nWe then projected monthly field into these three fields (again, for each vertical level) to obtain three time series, one for the classic “full” SAM, one for the asymmetric SAM (A-SAM) and one for the symmetric SAM (S-SAM).\nAs a sanity check, Figure 4 shows the regression of 700 hPa geopotential height and the three indices (the ones between A-SAM and S-SAM are actually the coefficients of multiple regression, check the paper for the details). And it works! The regression pattern of the full SAM index is the now-familiar SAM pattern. The pattern associated with the S-SAM is much more zonally symmetric and the one associated with the A-SAM is zonally asymmetric.\n\n\n\n\nFigure 4: Regression of 700 hPa geopotential height (meters) with (column a) SAM, (column b) A-SAM, and (column c) S-SAM for the 1979 – 2018 period.\n\n\n\nThe two faces of the SAM\nWith these indices at hand, we can now study the behaviours that are unique of the asymmetric or the symmetric SAM. For example, before I talked about the positive trend in the SAM index. Figure 5 show linear trends (in standard deviations per decade) for each index at each vertical level of the atmosphere.\n\n\n\n\nFigure 5: Linear trends (in standard deviations per decade) at each level for annual (row 1) and seasonal values (rows 2 to 5) for the period 1979 – 2018 and for the (column a) SAM index, (column b) A-SAM index, and (column c) S-SAM index. Shading indicates the 95% confidence interval from a t-distribution.\n\n\n\nNot surprisingly we detect the already-known positive trend of the SAM index, which is only present in the summer (and a but in autumn) and only in the troposphere (Fig. 5 column a). But what we also show is that only the symmetric part of the SAM has experienced a increase towards positive values (Fig. 5 column c), while the asymmetric part of the SAM appears to have suffered no long term (linear) trends ((Fig. 5 column b). Another added value of our paper is the computation of trends along many vertical levels. Most studies look at trends for a single SAM index defined using either 700 hPa geopotential height or sea level pressure. Here we show that the positive trend actually reaches its maximum near 100 hPa, which is much higher in the atmosphere.\n\n\n\n\nFigure 6: Linear trends (in percent per decade) of the variance explained by A-SAM and S-SAM at each level and for each trimester for the period 1979 – 2018.\n\n\n\nAnother interesting question is whether the SAM has become more or less asymmetric. Fogt, Jones, and Renwick (2012) suggested that the SAM is becoming more symmetric in summer and autumn between 1960 and 2000. In our study we use data between 1979 and 2018 (data before 1979 is highly suspect due to the lack of satellite observations) so it’s not terribly comparable, but we reach the opposite conclusion. Figure 6 shows linear trends of the explained variance of each index at each vertical level. In summer, the variance explained by the A-SAM in lower levels has increased by about 2% per decade. Honestly, this is not strong evidence by itself, so more research is needed™.\nAll that (and more!) indicates that the asymmetric part of the SAM behaves differently from the symmetric part. But we also show that they have different surface impacts.\n\n\n\n\nFigure 7: Regression of summer mean 2-metre temperature anomalies (Kelvin) from ERA5 with SAM, A-SAM and S-SAM for the 1979 – 2018 period. Black contours indicate areas with p-value smaller than 0.05 controlling for False Detection Rate. Note that the colour scale cuts-off at \\(\\pm0.6 \\mathrm{K}\\) to highlight mid-latitudes and tropics features at the expense of the higher values in polar regions.\n\n\n\nPanel a.1 in Figure 7 shows the regression between summer mean temperature and the classic SAM index. Compare it with panels b.1 and c.1, which show the same but for the A-SAM and S-SAM index. In most areas, you can see a relatively clean separation of the SAM relation ship into the asymmetric and symmetric component. For instance, in the Antarctic region positive values of the SAM are associated with negative temperature anomalies in an incomplete ring surrounding the continent. This ring is mostly explained by the S-SAM, while the A-SAM relationship with temperature is not so strong in these high latitudes.\nYou can look at the maps and find other differences (maps for other seasons are available on the paper), but I here I want to highlight what happens in the tropical oceans. Both in the Pacific and Indian ocean, there is no significant relationship between the SAM and air temperature, but there is a relationship between the A-SAM and temperatures there. That’s interesting to me, because it suggests that in some regions, there is an effect of the A-SAM that is masked by the S-SAM and thus is not detectable by using the full SAM index, which mixes the two.\nIf “temperature of the tropical Pacific” made you think of ENSO, you are not alone. It is known that ENSO is somewhat correlated with the SAM, but did you know know that there is no correlation between the zonally symmetric part of the SAM and ENSO in any season? If you look at Table 1, now you know! In fact, Table 1 also shows that the correlation with ENSO is higher for the A-SAM index than for the SAM index in all seasons except DJF.\n\n\nTable 1: Correlation between SAM indices and the Oceanic Niño Index. p-values corrected for False Detection Rate in parenthesis. In bold, correlations with p-value smaller than 0.05.\n\n\n\n\n\nCorrelation\n\n\n\n\nPartial correlation\n\n\n\n\n\nSAM\n\n\nA-SAM\n\n\nS-SAM\n\n\nYear\n\n\n-0.17 (0.001)\n\n\n-0.26 (<0.001)\n\n\n0.02 (0.775)\n\n\nDJF\n\n\n-0.31 (0.002)\n\n\n-0.30 (0.003)\n\n\n-0.17 (0.115)\n\n\nMAM\n\n\n-0.07 (0.530)\n\n\n-0.26 (0.011)\n\n\n0.14 (0.192)\n\n\nJJA\n\n\n0.01 (0.900)\n\n\n-0.14 (0.192)\n\n\n0.11 (0.300)\n\n\nSON\n\n\n-0.25 (0.014)\n\n\n-0.42 (<0.001)\n\n\n0.05 (0.686)\n\n\nThis is exciting because it says that if you want to study the relationship between the SAM and ENSO, you should probably look only at the S-SAM.\nMore SAM\nIf this piqued your interest, go read the rest of the paper (click here for a free, but DRMd copy). It covers other issues, such as the cross-correlation among levels, vertical regressions, and the relationship with precipitation. But overall, the point is that not only it’s possible to split the Southern Annular Mode into a zonally symmetric and a zonally asymmetric part, but it seems to be both physically meaningful and statistically useful.\nIf you want to use this on your research, you can get all the code that produced the paper on this repository and get the data for the three SAM indices here.\n\n\n\nArblaster, Julie M., and Gerald A. Meehl. 2006. “Contributions of External Forcings to Southern Annular Mode Trends.” Journal of Climate 19 (12): 2896–2905. https://doi.org/10.1175/JCLI3774.1.\n\n\nClem, Kyle R., and Ryan L. Fogt. 2013. “Varying Roles of ENSO and SAM on the Antarctic Peninsula Climate in Austral Spring.” Journal of Geophysical Research: Atmospheres 118 (20): 11, 481–11, 492. https://doi.org/10.1002/jgrd.50860.\n\n\nFogt, Ryan L., Julie M. Jones, and James Renwick. 2012. “Seasonal Zonal Asymmetries in the Southern Annular Mode and Their Impact on Regional Temperature Anomalies.” Journal of Climate 25 (18): 6253–70. https://doi.org/10.1175/JCLI-D-11-00474.1.\n\n\nFogt, Ryan L., and Gareth J. Marshall. 2020. “The Southern Annular Mode: Variability, Trends, and Climate Impacts Across the Southern Hemisphere.” WIREs Climate Change 11 (4): e652. https://doi.org/10.1002/wcc.652.\n\n\nSilvestri, Gabriel, and Carolina Vera. 2009. “Nonstationary Impacts of the Southern Annular Mode on Southern Hemisphere Climate.” Journal of Climate 22 (22): 6142–48. https://doi.org/10.1175/2009JCLI3036.1.\n\n\n\n\n",
    "preview": "posts/2021-08-09-asymsam/distill-preview.png",
    "last_modified": "2021-08-10T13:30:40-03:00",
    "input_file": {},
    "preview_width": 471,
    "preview_height": 471
  },
  {
    "path": "posts/2021-01-15-sam-symmetry/",
    "title": "Does the Southern Annular Mode exist?",
    "description": "Scavenging the literature on the Southern Annular Mode I came across two papers from the early 2000's which seem to question whether this mode is actually a global phenomenon and not a statistical artifact.",
    "author": [
      {
        "name": "Elio Campitelli",
        "url": "https://eliocamp.github.io/"
      }
    ],
    "date": "2021-01-15",
    "categories": [
      "SAM",
      "statistics",
      "general circulation"
    ],
    "contents": "\nIntroduction\nIn “The Structure and Composition of the Annular Modes in an Aquaplanet General Circulation Model” (Cash, Kushner, and Vallis 2002) and “Zonal Asymmetries, Teleconnections, and Annular Patterns in a GCM” (Cash, Kushner, and Vallis 2005) (CKV from now on), the authors analyse simulations on an aquaplanet model (in the former) and with some zonal asymmetries (in the latter). In particular, they study the configuration of their “annular modes” or, rather, their leading EOF. Their conclusion is that annular modes as seen from the leading EOF are a statistical artifact and that, in fact, they actually describe localised events.\nIf this is correct and is also valid for the real atmosphere (as opposed to their simple models), then it throws a monkey wrench to any attempts to understand the Souther Annular Mode –it doesn’t even exist as a physically meaningful entity.\nHere, I use reanalysis data to show that, while CKV raises important points, the concept of the global SAM is safe.\nCKV analysis\nCKV ran an aquaplanet model and they point out that the first EOF of sea level pressure describes an almost perfect annular mode.\n\n\n\n\nFigure 1: Figure 4 from Cash, Kushner, and Vallis (2002): Leading EOF of winter season surface pressure. (a) Normalized, nondimensional EOF of the zonal-mean surface pressure. (b) Regression map of zonal-mean surface pressure against the principal component of the leading EOF. Amplitude is the response to 1 std dev in the principal component. (Units: mb.) (c) As in (b), except for the zonally varying pressure. Solid lines are positive, dashed lines are negative, and a heavy contour denotes the zero line. Contour interval is 2 mb\n\n\n\nThe problem is that when the look at particular events of high / low values of EOF1, they are nowhere near “annular.”\n\n\n\n\nFigure 2: Excerpt from Figure 7 from Cash, Kushner, and Vallis (2002): High- and low-index annular-mode events. (a), (b), (c) High-index events. (d), (e), (f ) Low-index events. Events displayed are 3-day averages about the day that the projection coefficient attains its maximum value during the event. Solid contours are positive, dashed contours are negative, and a heavy contour denotes the zero line. Contour interval is 5 mb\n\n\n\nInspired by this disconnect between the structure of the EOF and the individual cases, they try a different approach. They go back to using teleconnection maps (correlation between SLP at one point and the rest of the globe) based on various latitudes. They conclude that negative correlations are maximised for points at 65º and 35º (Figure 2)\n\n\n\n\nFigure 3: SLP de casos seleccionados con eventos positivos (izquierda) y negativos (derecha)\n\n\n\nThese maps look like “zonally localised versions” of the global annular mode. From this (and other results), CKV conclude that\n\nThe low-frequency variability of the model is thus characterized by meridional dipoles in the sea level pressure, with centers near 35º and 65º latitude, and a zonal scale of 60º to 90º. Because these events are distributed uniformly in longitude in the aquaplanet model, they are represented in an EOF analysis as a single, zonally uniform pattern.\n\nStrong stuff.\nFurther analysis\nCKV’s proposal is intriguing, does the real atmosphere behaves thusly? The problem they put forward is very similar to the problem I had with Senapati, Dash, and Behera (2021) here so I’ll use similar methods.\n\n\nShow code\n\nlibrary(data.table)\nlibrary(magrittr)\nlibrary(metR)\nlibrary(ggplot2)\nlibrary(ggperiodic)\nlibrary(patchwork)\n\ntheme_set(theme_minimal() + \n            theme(panel.grid = element_blank()))\n\n# simple and dirty map\nmap <- ggplot2::map_data(\"world2\") %>%\n  subset(lat %between% c(-90, -10))\n\nquick_map <- list(geom_polygon(data = map,\n                               aes(long, lat, group = group), fill = NA, color = \"black\",\n                               size = 0.2),\n                  scale_x_longitude(),\n                  scale_y_latitude())\n\n\n\n\n\nShow code\n\n# This WILL take long. Go make yourself a cup of tea or brew some mate.\nera5_file <- here::here(\"_data\", \"era5-hgt.nc\")\n\nif (!file.exists(era5_file)) {\n  request <- list(\n    format = \"netcdf\",\n    product_type = \"monthly_averaged_reanalysis\",\n    variable = \"geopotential\",\n    pressure_level = \"700\",\n    year = c(\"1979\", \"1980\", \"1981\", \"1982\", \"1983\", \"1984\", \"1985\", \"1986\", \"1987\", \"1988\", \"1989\", \"1990\", \"1991\", \"1992\", \"1993\", \"1994\", \"1995\", \"1996\", \"1997\", \"1998\", \"1999\", \"2000\", \"2001\", \"2002\", \"2003\", \"2004\", \"2005\", \"2006\", \"2007\", \"2008\", \"2009\", \"2010\", \"2011\", \"2012\", \"2013\", \"2014\", \"2015\", \"2016\", \"2017\", \"2018\", \"2019\"),\n    month = c(\"01\", \"02\", \"03\", \"04\", \"05\", \"06\", \"07\", \"08\", \"09\", \"10\", \"11\", \"12\"),\n    time = \"00:00\",\n    area = c(-20, -180, -90, 180),\n    grid = c(\"2.5\", \"2.5\"),   # we don't need high resolution\n    dataset_short_name = \"reanalysis-era5-pressure-levels-monthly-means\",\n    target = basename(era5_file)\n  )\n  \n  # Need to set up user with\n  # ecmwfr::wf_set_key() \n  ecmwfr::wf_request(request, path = dirname(era5_file))\n}\n\n\n\n\n\nShow code\n\nhgt <- ReadNetCDF(era5_file, vars = c(hgt = \"z\")) %>% \n  setnames(c(\"latitude\", \"longitude\"),\n           c(\"lat\", \"lon\")) %>% \n  .[, lon := ConvertLongitude(lon)] %>%   # put longitude between 0 and 360\n  .[, hgt := hgt/9.8] %>% \n  .[, hgt_a := hgt - mean(hgt), by = .(lon, lat, month(time))] %>% \n  .[, hgt_m := mean(hgt_a), by = .(lat, time)] %>% \n  .[, hgt_z := hgt_a - hgt_m]\n\n\n\nLet’s first compute the Southern Annular Mode (SAM) as the leading EOF of the 700 hPa geopotential height south of 20ºS.\n\n\nShow code\n\nsam <- hgt %>% \n  copy() %>% \n  .[, hgt := hgt_a*sqrt(cos(lat*pi/180))] %>% \n  EOF(hgt ~ time | lon+ lat, n = 1, data = .)\n\n\n\n\n\nShow code\n\nsam$right %>% \n  periodic(lon = c(0, 360)) %>% \n  ggplot(aes(lon, lat)) +\n  geom_contour_fill(aes(z = hgt, fill = ..level..)) +\n  quick_map +\n  coord_polar() +\n  scale_fill_divergent_discretised(guide = \"none\")\n\n\n\n\nFigure 4: Spatial pattern of the leading EOF of 700 hPa monthly geopotential height anomalies (AKA Southern Annular Mode, AKA SAM).\n\n\n\nAnd now let’s compute localised SAM indices. At each longitude I will take a section of the data located between 45º West and 45º East of it and project the geopotential height field onto the corresponding SAM pattern (in Figure 4). The result is one “local SAM index” for each longitude.\n\n\nShow code\n\nlon_width <- 90\nlon_halfwidth <- lon_width/2\n\n# \"extended\" version of geopotential height \nhgt2 <- sam$right %>% \n  copy() %>% \n  setnames(\"hgt\", \"EOF\") %>% \n  hgt[., on = .NATURAL] %>% \n  qwrap(lon = c(0, 360) ~ c(-lon_halfwidth, 360 + lon_halfwidth))\n\n# For each longitude, compute EOF using a segment of lon_width width\n# centred in that longitude.\nlon_eofs <- lapply(unique(hgt$lon), function(base_lon) {\n  hgt2 %>% \n    .[lon %between% (base_lon + c(-lon_halfwidth, lon_halfwidth))] %>% \n    .[, .(eof = weighted.mean(hgt_a*EOF, cos(lat*pi/180))),\n      by = time] %>% \n    .[, base_lon := base_lon] %>% \n    .[]\n}) %>% \n  rbindlist()\n\n\n\nFollowing a similar argument from my analysis of the proposed wave-4 pattern, if the SAM pattern in Figure 4 was a statistical artifact formed by the combination of independent localised events, then the local SAM indices shouldn’t be correlated between each other at all. So let’s compute the pairwise correlation at each longitude.\n\n\nShow code\n\nlon_eofs %>% \n  widyr::pairwise_cor(base_lon, time, eof) %>% \n  ggplot(aes(item1, item2)) +\n  geom_contour_fill(aes(z = correlation, fill = ..level..), na.fill = 1) +\n  geom_contour2(aes(z = correlation), size = 0.2) +\n  geom_text_contour(aes(z = correlation, stroke.color = ..level..), color = \"black\",\n                    stroke = 0.2) +\n  scale_fill_divergent(\"Correlation\", \n                       super = ScaleDiscretised) +\n  scale_color_divergent(aesthetics = \"stroke.color\", guide = \"none\") +\n  scale_x_longitude() +\n  scale_y_longitude() +\n  coord_equal() \n\n\n\n\nFigure 5: Pairwise correlation between localised SAM indices.\n\n\n\nAnd form Figure 5 I feel that it’s clear that the local SAM indices are fairly well correlated. There is, though, a correlation minimum between ~120W and 60E. 120W coincides with the Amundsen Sea Low and where most of the wave activity related to El Niño Southern Oscillation is located, so is not surprising that this region appears notable.\nAnother test would be to compute the correlation map of each localised SAM index with the whole geopotential height field. Again, if the SAM was not global, then I would not expect to find a (relatively) complete SAM pattern associated with the localised indices.\n\n\nShow code\n\ncor_pattern <- lon_eofs %>% \n  .[base_lon %in% rev(seq(0, 360, length.out = 7))[-1]] %>% \n  .[hgt, on = \"time\", allow.cartesian = TRUE] %>% \n  .[, cor(hgt_a, eof), by = .(lon, lat, base_lon)]\n\n\n\n\n\nShow code\n\nbase_lons <- unique(cor_pattern$base_lon)\nwrap_ <- function(lon) {\n   lon <- ifelse(lon <= 0, lon + 360, lon)\n   lon <- ifelse(lon >= 360, lon - 360, lon)\n   lon\n}\n\nlims <- data.table(base_lon = unique(lon_eofs$base_lon)) %>% \n   .[, side1 := wrap_(base_lon + 45)] %>% \n   .[, side2 := wrap_(base_lon - 45)] %>% \n   .[base_lon %~% base_lons] \n\n\ncor_pattern %>% \n  periodic(lon = c(0, 360)) %>% \n  ggplot(aes(lon, lat)) +\n  geom_contour_fill(aes(z = V1, fill = ..level..), breaks = AnchorBreaks(exclude = 0)) +\n  geom_contour2(data = periodic(sam$right, lon = c(0, 360)),\n                aes(z = hgt), size = 0.2, breaks = AnchorBreaks(0, 0.01)) +\n  geom_vline(data = lims, aes(xintercept = side1)) +\n  geom_vline(data = lims, aes(xintercept = side2)) +\n  quick_map +\n  scale_fill_divergent(super = ScaleDiscretised) +\n  coord_polar() +\n  facet_wrap(.~base_lon, labeller = labeller(base_lon = LonLabel)) +\n  theme(axis.text = element_blank())\n\n\n\n\nFigure 6: Correlation maps between 700 hPa monthly geopotential height anomalies and localised SAM indices at differnet centre longidutes. Black contours indicate the original SAM pattern and black lines delineate the longitudes used to compute each localised SAM index.\n\n\n\nFigure 6 shows the correlation patterns for the local SAM indices with central longitudes of 0°, 60°E, 120°E, 180°, 120°W, and 60°W. The original SAM pattern is overlaid with contours for comparison. Although with some differences, I’d argue that in all cases the classic SAM pattern is clearly visible.\nNull hypothesis\nI now wonder… how would the null hypothesis of no global SAM looked under these same methods? I don’t have CKV data handy, but I can run simulations.\nFirst, replace the zonally varying SAM with it’s zonal mean component. Then, use that pattern to simulate a global, zonally symmetric, geopotential field. Finally, multiply that field with a localised Gaussian function with a random central longitude and 45º standard deviation. An example field is shown in Figure 7.\n\n\nShow code\n\nmean_eof <- copy(sam)\n\nmean_eof$right[, hgt := mean(hgt), by = lat]\n\nzonal_amplitude <- function(lon, central_lon) {\n  amplitude <- suppressWarnings(circular::dwrappednormal(lon*pi/180, mu = central_lon[1]*pi/180, sd = 45*pi/180))\n  amplitude[amplitude <= 0.05] <- 0\n  amplitude/max(amplitude)\n}\n\n# Grid\nsimulation <- CJ(lon = unique(hgt$lon), \n                 lat = unique(hgt$lat),\n                 time = unique(hgt$time)) %>% \n  predict(mean_eof)[., on = .NATURAL] %>% \n  setnames(\"hgt\", \"annular\") %>% \n  na.omit() %>% \n  .[, central_lon := runif(1, 0, 360), by = time] %>% \n  .[, zonal_amplitude := zonal_amplitude(lon, central_lon), by = .(time)] %>% \n  .[, hgt := zonal_amplitude*annular/sqrt(cos(lat*pi/180))]\n\n\n\n\n\nShow code\n\nsimulation[time == unique(time)[1]] %>% \n  periodic(lon = c(0, 360)) %>% \n  ggplot(aes(lon, lat)) +\n  geom_contour_fill(aes(z = annular)) +\n  quick_map +\n  scale_fill_divergent(guide = \"none\") +\n  coord_polar() +\n  labs(subtitle = \"Zonally symmetric anomaly\") +\n  \n  simulation[time == unique(time)[1]] %>% \n  periodic(lon = c(0, 360)) %>% \n  ggplot(aes(lon, lat)) +\n  geom_contour_fill(aes(z = zonal_amplitude)) +\n  quick_map +\n  scale_fill_divergent(guide = \"none\") +\n  coord_polar() +\n  labs(subtitle = \"Localisation function\") + \n  \n  \n  simulation[time == unique(time)[1]] %>% \n  periodic(lon = c(0, 360)) %>% \n  ggplot(aes(lon, lat)) +\n  geom_contour_fill(aes(z = hgt)) +\n  quick_map +\n  scale_fill_divergent(guide = \"none\") +\n  coord_polar() +\n  labs(subtitle = \"Final geopotential field\") + \n\n\n  plot_layout(ncol = 3) & theme(axis.text = element_blank())\n\n\n\n\nFigure 7: Example of a single simulated geopotential height field. The zonally symmetric SAM pattern (left) is multiplied by the localisation function (middle), which reulsts in a localised pattern of positive and negative anomalies.\n\n\n\nCKV’s contention is that the leading EOF of an atmosphere consisting solely on localised patterns such as the last row of Figure 7 will appear as a single annular pattern. Let’s see first if that’s correct.\n\n\nShow code\n\nsim_eof <- simulation %>% \n  .[lat >= -85] %>% \n  .[, hgt := Anomaly(hgt)*sqrt(cos(lat*pi/180)), by = .(lon, lat, month(time))] %>% \n  .[, EOF(hgt ~ time | lon + lat, n = 1)]\n\n\n\n\n\nShow code\n\nsim_eof$right %>%\n  periodic(lon = c(0, 360)) %>% \n  ggplot(aes(lon, lat)) +\n  geom_contour_fill(aes(z = hgt)) +\n  quick_map +\n  scale_fill_divergent(guide = \"none\") +\n  coord_polar()\n\n\n\n\nFigure 8: Leading EOF of simulated geopotential height fields.\n\n\n\nFigure 8 shows the leading EOF of the simulated data. And indeed, even thought by construction the data doesn’t have an annular mode, one appears as the leading EOF plain as day. Now let’s put them through the same process as the real data. Get the localised SAM indices and compute the pairwise correlation between them.\n\n\nShow code\n\n# \"extended\" version of geopotential height \nhgt2 <- sim_eof$right %>% \n  copy() %>% \n  setnames(\"hgt\", \"EOF\") %>% \n  simulation[., on = .NATURAL] %>% \n  qwrap(lon = c(0, 360) ~ c(-lon_halfwidth, 360 + lon_halfwidth))\n\n# For each longitude, compute EOF using a segment of lon_width width\n# centred in that longitude.\nlon_eofs_sim <- lapply(unique(hgt$lon), function(base_lon) {\n  hgt2 %>% \n    .[lon %between% (base_lon + c(-lon_halfwidth, lon_halfwidth))] %>% \n    .[, .(eof = weighted.mean(hgt*EOF, cos(lat*pi/180))),\n      by = time] %>% \n    .[, base_lon := base_lon] %>% \n    .[]\n}) %>% \n  rbindlist()\n\n\n\n\n\n\nShow code\n\nlon_eofs_sim %>% \n  widyr::pairwise_cor(base_lon, time, eof) %>% \n  ggplot(aes(item1, item2)) +\n  geom_contour_fill(aes(z = correlation, fill = ..level..), na.fill = 1) +\n  geom_contour2(aes(z = correlation), size = 0.2) +\n  geom_text_contour(aes(z = correlation, stroke.color = ..level..), color = \"black\",\n                    stroke = 0.2) +\n  scale_fill_divergent(\"Correlation\",\n                       super = ScaleDiscretised) +\n  scale_color_divergent(aesthetics = \"stroke.color\", guide = \"none\") +\n  scale_x_longitude() +\n  scale_y_longitude() +\n  coord_equal() \n\n\n\n\nFigure 9: Same as Figure 5 but for the simulated fields.\n\n\n\nComparing Figure 9 with Figure 5, the results of the simulation are very different! As expected, the correlation between indices decreases rather rapidly between adjacent longitudes, and it’s near zero for the antipodes.\nConslusion\nI think that CKV does bring up an important point. The fact that one can compute a global EOF doesn’t mean that the observed pattern is indeed global. EOF is a statistical method not constrained by physics and as the simulated data shows, you can very well obtain an annular mode with data that doesn’t vary annularly.\nHowever, in the real atmosphere, the Southern Annular Mode does appear as a globally coherent annular mode. The SAM is safe.\nDownload code\nClick on this button to get the code that generated this document:\n\n\n Download code\n\n\n\n\n\nCash, Benjamin A., Paul J. Kushner, and Geoffrey K. Vallis. 2002. “The Structure and Composition of the Annular Modes in an Aquaplanet General Circulation Model.” J. Atmos. Sci. 59 (23): 3399–3414. https://doi.org/10.1175/1520-0469(2002)059<3399:TSACOT>2.0.CO;2.\n\n\n———. 2005. “Zonal Asymmetries, Teleconnections, and Annular Patterns in a GCM.” J. Atmos. Sci. 62 (1): 207–19. https://doi.org/10.1175/JAS-3361.1.\n\n\nSenapati, Balaji, Mihir K. Dash, and Swadhin K. Behera. 2021. “Global Wave Number-4 Pattern in the Southern Subtropical Sea Surface Temperature.” Scientific Reports 11 (1): 142. https://doi.org/10.1038/s41598-020-80492-x.\n\n\n\n\n",
    "preview": "posts/2021-01-15-sam-symmetry/distill-preview.png",
    "last_modified": "2021-08-10T13:27:09-03:00",
    "input_file": {},
    "preview_width": 1248,
    "preview_height": 768
  },
  {
    "path": "posts/2021-01-15-sao-and-jet/",
    "title": "The meridional structure of the Semiannual Oscillation",
    "description": "How to filter out extra-tropical variabilty to highlight the structure of the Semiannual Oscillation using just multiple linear regression.",
    "author": [
      {
        "name": "Elio Campitelli",
        "url": "https://eliocamp.github.io/"
      }
    ],
    "date": "2021-01-15",
    "categories": [
      "Semiannual Oscillation",
      "general circulation",
      "tropics",
      "stratosphere"
    ],
    "contents": "\nSome time ago, with a Journal Club I’m part of (shout-out to Go stratospheric!), we read “Representation of the equatorial stratopause semiannual oscillation in global atmospheric reanalyses” (Kawatani et al. 2020), a paper about the Semiannual Oscillation (SAO). One figure (Figure 1) piqued our interest. The SAO is supposed to be a characteristic of the tropical stratosphere and be… you know… semiannual. But in Figure 1, the more sticking feature is extra-tropical and with an annual cycle.\n\n\n\nShow code\n\nknitr::include_graphics(file.path(\"img\", \"sao-jet-fig8.png\"))\n\n\n\n\nFigure 1: Figure 8 from Kawatani et al. (2020): “Time–latitude sections of climatological mean annual cycle of the zonal mean zonal wind for (a) SABER, (b) MLS, and (c–i) each reanalysis at 1 hPa. The contour intervals are 10 m s−1. Climatology is calculated from 1980 to 2010 in the reanalyses, from 2002 to 2016 in SABER, and from 2005 to 2016 in MLS.”\n\n\n\nWe quickly realised that there’s more going on there than the SAO. Is there a way to filter out the rest of the variability and only look at the SAO-related variabiltiy?\nAs always, first thing first. Download the data and replicate the figure. Kawatani et al. (2020) use data from many many reanalyses, but I’m only going to use data from ERA5.\n\n\nShow code\n\nlibrary(magrittr)\nlibrary(data.table)\nlibrary(ggplot2)\nlibrary(metR)\ntheme_set(theme_minimal(base_size = 10) + theme(panel.grid = element_blank()))\n\n\n\n\n\nShow code\n\n# This WILL take long. Go make yourself a cut of tea or brew some mate.\nera5_file <- here::here(\"_data\", \"era5-u.nc\")\n\nif (!file.exists(era5_file)) {\n  request <- list(\n    format = \"netcdf\",\n    product_type = \"monthly_averaged_reanalysis\",\n    variable = \"u_component_of_wind\",\n    pressure_level = c(\"1\", \"2\", \"3\", \"5\", \"7\", \"10\", \"20\", \"30\"),\n    year = c(\"1979\", \"1980\", \"1981\", \"1982\", \"1983\", \"1984\", \"1985\", \"1986\", \"1987\", \"1988\", \"1989\", \"1990\", \"1991\", \"1992\", \"1993\", \"1994\", \"1995\", \"1996\", \"1997\", \"1998\", \"1999\", \"2000\", \"2001\", \"2002\", \"2003\", \"2004\", \"2005\", \"2006\", \"2007\", \"2008\", \"2009\", \"2010\", \"2011\", \"2012\", \"2013\", \"2014\", \"2015\", \"2016\", \"2017\", \"2018\", \"2019\"),\n    month = c(\"01\", \"02\", \"03\", \"04\", \"05\", \"06\", \"07\", \"08\", \"09\", \"10\", \"11\", \"12\"),\n    time = \"00:00\",\n    grid = c(\"2.5\", \"2.5\"),   # we don't need high resolution\n    dataset_short_name = \"reanalysis-era5-pressure-levels-monthly-means\",\n    target = basename(era5_file)\n  )\n  \n  # Need to set up user with\n  # ecmwfr::wf_set_key() \n  ecmwfr::wf_request(request, path = dirname(era5_file))\n}\n\n\n\n\n\nShow code\n\nera5 <- ReadNetCDF(era5_file)\n\n\n\n\n\nShow code\n\nera5 %>% \n  .[level == 1] %>% \n  .[, .(u = mean(u)), by = .(latitude, month(time), level)] %>% \n  ggplot(aes(month, latitude)) +\n  geom_contour_fill(aes(z = u, fill = ..level..), \n                    breaks = AnchorBreaks(0, binwidth = 15, exclude =  0)) +\n  geom_contour_tanaka(aes(z = u), \n                      breaks =  AnchorBreaks(0, binwidth = 15, exclude =  0)) +\n  scale_y_latitude() +\n  scale_x_continuous(breaks = 1:12, labels = month.abb, expand = c(0, 0)) +\n  scale_fill_divergent_discretised(\"U\") +\n  facet_wrap(~level, labeller = labeller(level = function(x) paste0(x, \" hPa\")))\n\n\n\n\nFigure 2: Seasonal cycle of zonal mean zonal wind at 1 hPa\n\n\n\nFigure 2 replicated Figure 1 extending the latitude range to the rest of the globe. It becomes even clearer that the main variability is in the extratropics.\nNow, the SAO not only is supposed to be in the tropics, but it’s also restricted to levels higher than ~3 hPa. Figure 3 shows what’s going on at levels bewteen 1 hPa and 30 hPa.\n\n\n\nShow code\n\nlast_plot() %+%\n  era5[, .(u = mean(u)), by = .(latitude, month(time), level)]\n\n\n\n\nFigure 3: Same as Figure 2 but for multiple levels.\n\n\n\nThe variability in the extratopics is there in the lower levels. So I though, why don’t try to remove that lower-level signal? After looking at Figure 3 and trying around, I settled into representing the lower levels with 5 hPa and 20 hPa.\nSo, at each gridpoint I fit the model\n\\[\nU_{1hPa} = \\alpha U_{5hPa} + \\beta U_{20hPa} + \\epsilon_{1hPa}\n\\]\nWhere \\(U\\) is the zonal mean zonal wind at each level and \\(\\epsilon_{1hPa}\\) is the residual wind that I’m interested in. That is, the variability of zonal mean zonal wind at 1 hPa that is not (linearly) explained by the variability of the zonal mean zonal wind at the lower levels. For those paying attention, this is (I think) essentially removing the equivalent barotropic component in the wind.\n\n\nShow code\n\nfiltered  <- era5 %>% \n  .[level %in% c(1, 5, 20)] %>% \n  # .[, .(u = mean(u)), by = .(time, level, latitude)] %>%\n  dcast(time + latitude + longitude ~ level, value.var = \"u\") %>% \n  .[, u_resid := resid(lm(`1` ~ `5` + `20`)), by = .(latitude, longitude)] \n\n\n\nThe seasonal cycle of the residual zonal mean zonal wind in Figure 4 shows that the filtering really works! Now it really looks like the equatorial phenomenon that it’s supposed to be, and the semiannual cycle is plainly for all to see. 🥳.\n\n\nShow code\n\nfiltered %>% \n  .[, .(u = mean(u_resid)), by = .(month(time), latitude)] %>% \n  ggplot(aes(month, latitude)) +\n  geom_contour_fill(aes(z = u, fill = ..level..), \n                    breaks = AnchorBreaks(0, binwidth = 10, exclude =  0)) +\n  geom_contour_tanaka(aes(z = u), \n                      breaks =  AnchorBreaks(0, binwidth = 10, exclude =  0)) +\n  scale_y_latitude() +\n  scale_x_continuous(breaks = 1:12, labels = month.abb, expand = c(0, 0)) +\n  scale_fill_divergent_discretised(\"U\")\n\n\n\n\nFigure 4: Seasonal cycle of the residual zonal mean zonal wind.\n\n\n\nAnd for completitude, Figure 5 shows timeseries of zonal mean zonal wind at the equator, and averaged polarward of 30°. In the equator, the residual zonal wind is virtually identical to the unfiltered zonal wind.\n\n\nShow code\n\nfiltered %>% \n  .[, zone := fcase(latitude > 30, \"north of 30°N\",\n                    latitude < -30, \"south of 30°S\",\n                    latitude == 0, \"equator\",\n                    default = NA)] %>% \n  na.omit() %>% \n  .[, .(u = mean(`1`),\n        u_resid = mean(u_resid)), by = .(time, zone)] %>% \n  melt(id.vars = c(\"time\", \"zone\")) %>% \n  ggplot(aes(time, value)) +\n  geom_line(aes(color = variable)) +\n  scale_color_brewer(NULL, palette = \"Dark2\", labels = c(u = \"U\", \n                                                         u_resid = \"Residual U\")) +\n  scale_y_continuous(NULL) +\n  facet_wrap(zone~., ncol = 1) \n\n\n\n\nFigure 5: Timeseries of zonal mean zonal wind and residual zonal wind in the equator, averaged north of 30°N and south of 30°S\n\n\n\nSo the conclusion, I think, is that the meridional structure was a function of the polar jets, and that looking at the SAO by looking at zonal mean zonal wind in the equator is fine.\nDownload code\nClick on this button to get the code that generated this document:\n\n\n Download code\n\n\n\n\n\nKawatani, Yoshio, Toshihiko Hirooka, Kevin Hamilton, Anne K. Smith, and Masatomo Fujiwara. 2020. “Representation of the Equatorial Stratopause Semiannual Oscillation in Global Atmospheric Reanalyses.” Atmospheric Chemistry and Physics 20 (14): 9115–33. https://doi.org/10.5194/acp-20-9115-2020.\n\n\n\n\n",
    "preview": "posts/2021-01-15-sao-and-jet/distill-preview.png",
    "last_modified": "2021-08-10T13:25:08-03:00",
    "input_file": {},
    "preview_width": 1248,
    "preview_height": 768
  },
  {
    "path": "posts/2021-01-14-enso-and-regression-to-the-mean/",
    "title": "ENSO and regression to the mean",
    "description": "How a recent paper published in Nature was pray to regression to the mean.",
    "author": [
      {
        "name": "Elio Campitelli",
        "url": "https://eliocamp.github.io/"
      }
    ],
    "date": "2021-01-14",
    "categories": [
      "ENSO",
      "statistics"
    ],
    "contents": "\nOn a recent article, Cai et al. (2020) used a perturbed ensemble of 40 members to show that members with relatively low El Niño Southern Oscillation (ENSO) variability at the beginning of the simulated period have a greater increase in ENSO variability towards the end of the simulated period than members with relatively high ENSO variability. They take this as evidence of ENSO self-regulation which would, if real, have important implications for future projections of ENSO variability under global warming. Here, I show that their results are not surprising, are likely product of simple regression to the mean and have no physical interpretation.\nIntroduction\nThe Community Earth System Model Large Ensemble model (Kay et al. 2015) consists of 40 climate simulations (members) that ran from 1920 to 2100 with identical external forcing and physics. Their only difference is a small, round-off error, perturbation in their atmospheric initial conditions. Cai et al. (2020) computed, for each member, the variability (standard deviation) of an index of Eastern-Pacific ENSO they call “E-index” for the first and last 50 years of the simulation. Owing to the effect of the various initial conditions, the variability in the E-index varied between members. I show their main result in Figure 1, which reproduces their Figure 1b. It shows a negative correlation between the initial E-index variability and its future change, defined as the difference between the final and the initial E-index variability.\n\n\nShow code\n\nlibrary(magrittr)\nlibrary(data.table)\nlibrary(ggplot2)\nlibrary(patchwork)\ntheme_set(theme_minimal(base_size = 10) + theme(panel.grid = element_blank()))\n\n\n\n\n\nShow code\n\nobs_paper <- fread(here::here(\"public_data\", \"enso-data-fig1.csv\")) %>% \n  .[, final := initial + change]\nmoments <- obs_paper[, .(mean_initial = mean(initial), \n                         sd_initial = sd(initial),\n                         mean_final = mean(final),\n                         sd_final = sd(final))]\n\n\n\n\n\nShow code\n\nset.seed(42)\nmembers <- 40\nB <- 10000\nsims_normal <- CJ(sim = seq_len(B), member = seq_len(members)) %>% \n  .[, `:=`(initial = rnorm(.N, moments$mean_initial, moments$sd_initial),\n           final   = rnorm(.N, moments$mean_final, moments$sd_final))] %>% \n  .[, change := final - initial]\n\n\n\n\n\n\nShow code\n\ncor <- obs_paper[, cor.test(initial, change)]\n\ncor_text <- with(cor, paste0(\"R = \", signif(estimate, 2), \"\\nP ~ \", signif(p.value, 2)))\n\nobs_paper[, rank := cut_number(initial, 3)]\n\nobs_paper %>% \n  ggplot(aes(initial, change)) +\n  geom_point() +\n  geom_smooth(method = \"lm\", color = \"#0e9a83\") +\n  annotate(\"text\", label = cor_text, x = .51, y = 0, hjust = 0, size = 4) +\n  scale_x_continuous(\"Initial E-index variability (s.d.)\") +\n  scale_y_continuous(\"Change in E-index variability (s.d.)\") \n\n\n\n\nFigure 1: Reproduction of Figure 1b from Cai et al. (2020) based on digitised values. The horizontal axis shows the initial variability of their ENSO index for the first 50 years of simulation (1920 – 1969) and the vertical axis shows the difference between the variability of their ENSO index for the last 50 years of the simulation (2050 – 2099) and the first 50 years.\n\n\n\nFrom this negative correlation, Cai et al. (2020) conclude that “strikingly, in experiments with initially higher ENSO variability (…), [its] amplitude in the future a century later [is] systematically smaller, and vice versa.” They attribute this to a novel mechanism of self-regulation involving non-linear thermal damping through upper-ocean heat exchange and stratification.\nSimulations\nTo test how striking this result really is, I created \\(10^{4}\\) simulations of 40 pairs of random numbers representing the initial and final variability of the E-index for 40 hypothetical ensemble members. The random numbers were taken from independent normal distribution with \\(\\mu=0.8\\) and \\(\\sigma = 0.14\\) for the initial variability and \\(\\mu=0.93\\), \\(\\sigma = 0.072\\) for the final variability. These are the mean and standard deviation from the observed values derived from Figure 1.\nAs each simulated observation is independent from the rest, this simulations serve as a plausible model for the null hypothesis that the initial variability of ENSO does not influence it’s future change.\n\n\nShow code\n\ntwo_plots <- function(sim, obs, n = 1:10) {\n  fits <- sim[, metR::FitLm(change, initial, se = TRUE), by = sim] %>% \n    .[term != \"(Intercept)\"] %>% \n    .[, p_value := pt(abs(estimate)/std.error, df, lower.tail = FALSE), by = sim]\n  \n  obs_fits <- obs[, metR::FitLm(change, initial, se = TRUE)] %>% \n    .[term != \"(Intercept)\"] %>% \n    .[, p_value := pt(abs(estimate)/std.error, df, lower.tail = FALSE)]\n  \n  p_value <- fits[, mean(r.squared >= obs_fits$r.squared)]\n  \n  fit_density <- as.data.table(density(fits[term != \"(Intercept)\"]$r.squared)[c(\"x\", \"y\")])\n  \n  x_pval <- mean(fits[term != \"(Intercept)\"][r.squared >= obs_fits$r.squared]$r.squared)\n  y_pval <- mean(fit_density$y)\n  \n  sim[sim %in% 1:10] %>% \n    .[, change := change] %>% \n    ggplot(aes(initial, change)) +\n    geom_point(size = 0.4, alpha = 0.3) + \n    geom_point(data = obs, size = 0.7) +\n    geom_smooth(data = obs, method = \"lm\", se = FALSE, size = 1.4,\n                fullrange = TRUE, color = \"#0e9a83\") +\n    geom_smooth(method = \"lm\", aes(group = sim), se = FALSE, fullrange = TRUE, \n                color = \"black\", size = 0.1, alpha = 0.5) +\n    scale_x_continuous(\"Initial E-index variability (s.d.)\") +\n    scale_y_continuous(\"Change in E-index variability (s.d.)\") +\n  # coord_equal()  +\n  \n  fit_density %>% \n    ggplot(aes(x, y)) +\n    geom_area(data = ~.x[x >= obs_fits$r.squared], fill = \"#4d4d4d\") +\n    annotate(\"text\", size = 6, color = \"white\",\n             label = scales::percent(p_value), x = x_pval, y = y_pval) +\n    geom_line() +\n    geom_vline(xintercept = obs_fits$r.squared, color = \"#0e9a83\", size = 1.4) +\n    scale_x_continuous(\"r²\") +\n    scale_y_continuous(NULL) +\n    \n    \n    plot_annotation(tag_levels = \"a\")\n}\n\ncompute_pvalue <- function(sim, obs) {\n  fits <- sim[, metR::FitLm(change, initial, se = TRUE), by = sim] %>% \n    .[term != \"(Intercept)\"] %>% \n    .[, p_value := pt(abs(estimate)/std.error, df, lower.tail = FALSE), by = sim]\n  \n  obs_fits <- obs[, metR::FitLm(change, initial, se = TRUE)] %>% \n    .[term != \"(Intercept)\"] %>% \n    .[, p_value := pt(abs(estimate)/std.error, df, lower.tail = FALSE)]\n  \n  fits[, mean(r.squared >= obs_fits$r.squared)]\n}\n\n\n\n\n\n\nShow code\n\ntwo_plots(sims_normal, obs_paper)\n\n\n\n\nFigure 2: a. Ten simulated ensembles of 40 members drawn from random numbers (see description in text) in small dot and their linear regression in fine lines. The observed values from Cai et al. (2020) in big dots and the linear regression in think, green. b. Estimated probability density of the coefficient of determination (\\(r^2\\)) under the null hypothesis model. The vertical bar shows the observed \\(r^2\\) and the shaded area is the proportion of simulated samples from the null hypothesis model with a \\(r^2\\) equal or greater than the observed one.\n\n\n\nFigure 2.a shows a random sample of 10 of these simulations in small dots and their respective linear fit in fine lines. Comparing these random simulations with the observed values taken from Cai et al. (2020) – shown in big dots and thick, green line – puts into perspective the strength of their evidence. The spread of the simulated data is very similar to the real data and all 10 simulation have a steeper regression slope. Both sets are so similar that it would be virtually impossible to distinguish between the simulated and real data if not for the different size of the points.\n\n\nShow code\n\np_value <- compute_pvalue(sims_normal, obs_paper)\n\n\n\nTo quantify how surprising the observed effect actually is, Figure 2.b shows the estimated probability density of the coefficient of determination (\\(r^2\\)) from the linear fit of the 10^{4} simulations and the observed value as a vertical line. 74% of simulations show an \\(r^2\\) equal or greater than the observed one. This translates to a p-value of 0.74; significantly higher than \\(1.4\\times 10^{-12}\\), naively computed from the linear regression.\nThen, it’s evidently clear that under this model of the null hypothesis the observed negative correlation is not only unsurprising, but completely expected.\nThe fact that the initial value of a variable is negatively correlated with its “future change” is one of the manifestation of the general principle of regression to the mean first observed by Galton in 1889 (Francis Galton 1889). He noted that very tall parents tended to have relatively shorter children while tall children tended to have relatively shorter parents.\nIn a perturbed ensemble experiment some ensemble members will have higher initial ENSO variability than average, while other will have lower ENSO variability than average. If this initial ENSO variability is completely independent of further ENSO variability (e.g. the null hypothesis is true), then both groups are equally likely to have average variability further down the simulation. Thus, members which a high initial ENSO variability will tend to show – on average – a negative change in variability, an vice versa.\nFormal formula\nIt’s straightforward to show this effect mathematically. The correlation between two variables \\(x\\) and \\(z = y - x\\) can be written as:\n\\[\\begin{equation}\n\\tag{1}\n\\mathrm{cor}(x, y - x) = \\frac{\\mathrm{cov(x, y) - \\mathrm{var}(x)}}{\\sqrt{\\mathrm{var}(x)\\mathrm{var}(y) + \\mathrm{var}(x)^2 - 2\\mathrm{var}(x)\\mathrm{cov}(x, y)}}\n\\end{equation}\\]\nIf \\(x\\) and \\(y\\) are independent random variables, \\(\\mathrm{cov}(x, y) = 0\\) vanish and Equation (1) simplifies to\n\\[\\begin{equation}\n\\tag{2}\n\\mathrm{cor}(x, y - x)= \\frac{-1}{\\sqrt{\\mathrm{var}(y)/\\mathrm{var}(x) +1}}\n\\end{equation}\\]\nThis final formula shows that the correlation between \\(x\\) and \\(y - x\\) is bound to be negative and its magnitude depends only on the relationship between their variances. That is, if the variance of \\(y\\) is greater than the variance of \\(x\\), then the correlation will be small, and vice versa.\nApplying Equation (2) to the issue at hand, \\(x\\) becomes the initial ENSO variability and \\(y\\), the final ENSO variability and \\(\\mathrm{var}(x)\\), \\(\\mathrm{var}(y)\\) are the ensemble spread in initial and final ENSO variability, respectively. This means that, even in the case of no linear relation between initial and final variability, any process – either driven by physics or models – which reduces ensemble spread will lead to an even stronger negative linear relationship between the variables.\n\n\nShow code\n\nalpha_obs <- moments[, sd_final/sd_initial]^2\npred <- -1/sqrt(alpha_obs + 1)\n\n\n\nIn the case of equal variances, Equation (2) predicts a correlation of \\(-1/\\sqrt{2} \\sim -0.71\\). The observed correlation of -0.86 (Figure 1) is stronger This is explained by the reduced ensemble spread in ENSO variability between the initial and final periods, as the final spread is around 29% of the initial spread. For this value, Equation (2) predicts a correlation of -0.88, which is very close (if a bit stronger) to the observed value.\n\nConclusion\nThe previous analysis puts the strength of Cai et al. (2020) evidence into perspective. That the change in ENSO variability is greater in ensemble members with initially low ENSO variability is not at all surprising. By simulating the null hypothesis, I show that a negative correlations as strong or stronger than the one observed by Cai et al. (2020) can be expected 74% of the time.\nThese strong negative correlation can be explained by regression towards the mean and reduced ensemble spread in the final period compared to the initial period. I don’t think it is possible to identify the source of the spread reduction. It might be a real response to the forcing scenario or inability of the ensemble to capture all the sources of variability. In particular, all members share the same physics and boundary conditions, therefore I believe it would not be unexpected if all members slowly converged to a similar state. Kay et al. (2015)’s Figure 2 does appear to show that the ensemble spread is slightly higher before 1970. Of note, recently Bengtsson and Hodges (2019) observed secular reductions of ensemble spread in mean surface temperature in an ensemble whose members where also all forced with the same radiative conditions.\nFailing to account for regression to the mean is a fallacy that affects many fields of science – including behavioural science (Kelly and Price 2005) and medicine (Chuang-Stein and Tong 1997) – and features prominently in popular culture, such as the “Sports Illustrated cover jinx” – the perception that an athlete’s performance will be “cursed” after appearing in the cover of Sports Illustrated (Goldacre 2008). Cai et al. (2020) is not the first paper nor will be the last to fall for it.\nDownload code\nClick on this button to get the code that generated this document:\n\n\n Download code\n\n\n\n\n\nBengtsson, L., and K. I. Hodges. 2019. “Can an Ensemble Climate Simulation Be Used to Separate Climate Change Signals from Internal Unforced Variability?” Clim Dyn 52 (5): 3553–73. https://doi.org/10.1007/s00382-018-4343-8.\n\n\nCai, Wenju, Benjamin Ng, Tao Geng, Lixin Wu, Agus Santoso, and Michael J. McPhaden. 2020. “Butterfly Effect and a Self-Modulating El Niño Response to Global Warming.” Nature 585 (7823): 68–73. https://doi.org/10.1038/s41586-020-2641-x.\n\n\nChuang-Stein, Christy, and Donald M Tong. 1997. “The Impact and Implication of Regression to the Mean on the Design and Analysis of Medical Investigations.” Statistical Methods in Medical Research 6 (2): 115–28. https://doi.org/10.1177/096228029700600203.\n\n\nFrancis Galton. 1889. Natural Inheritance.\n\n\nGoldacre, Ben. 2008. Bad Science. HarperCollins UK.\n\n\nKay, J. E., C. Deser, A. Phillips, A. Mai, C. Hannay, G. Strand, J. M. Arblaster, et al. 2015. “The Community Earth System Model (CESM) Large Ensemble Project: A Community Resource for Studying Climate Change in the Presence of Internal Climate Variability.” Bull. Amer. Meteor. Soc. 96 (8): 1333–49. https://doi.org/10.1175/BAMS-D-13-00255.1.\n\n\nKelly, Colleen, and Trevor D. Price. 2005. “Correcting for Regression to the Mean in Behavior and Ecology.” Am Nat 166 (6): 700–707. https://doi.org/10.1086/497402.\n\n\n\n\n",
    "preview": "posts/2021-01-14-enso-and-regression-to-the-mean/distill-preview.png",
    "last_modified": "2021-08-10T13:19:17-03:00",
    "input_file": {},
    "preview_width": 1248,
    "preview_height": 768
  },
  {
    "path": "posts/2021-01-14-wave4/",
    "title": "Analysis of \"Global wave number-4 pattern in the southern subtropical sea surface temperature.\"",
    "description": "A recent paper claims to have detected a global wave-4 pattern in subtropical SSTs. But have they really?",
    "author": [
      {
        "name": "Elio Campitelli",
        "url": "https://eliocamp.github.io/"
      }
    ],
    "date": "2021-01-14",
    "categories": [
      "zonal waves",
      "general circulation"
    ],
    "contents": "\nThis are some quick notes on Global wave number-4 pattern in the southern subtropical sea surface temperature (Senapati, Dash, and Behera 2021). The article claims to discover a wave-4 pattern in the southern Sea Surface Temperature (SST). Their basic method is to perform Empirical Orthogonal Function (EOF) to SST between 55°S and 20°S. They discard the first EOF as uninteresting because it’s “ENSO-like” (unsurprising) and focus on the second EOF, whose spatial pattern is in Figure 1.\n\n\n\n\nFigure 1: Panel a from Senapati, Dash, and Behera (2021)’s Figure 1: Spatial pattern of second leading EOF mode of SST anomaly over the region (20°S-55°S) from HadSST.\n\n\n\nFirst things first. Download the data and try to reproduce their figure.\n\n\nShow code\n\n# packages\nlibrary(magrittr)\nlibrary(data.table)\nlibrary(metR)\nlibrary(ggplot2)\n\n\n# fast detrend.\nDetrend <- function(y, x) {\n  nas <- is.na(y)\n  m <- mean(y, na.rm = TRUE)\n  if (!hasArg(x)) x <- seq_along(y)\n  y[!nas] <- .lm.fit(cbind(1, x[!nas]), y[!nas])$residuals\n  return(y + m)\n}\n\ntheme_set(theme_minimal() + \n            theme(panel.grid = element_blank()))\n# simple and dirty map\nmap <- ggplot2::map_data(\"world2\") %>%\n  subset(lat %between% c(-90, -0))\n\nquick_map <- list(geom_polygon(data = map,\n                               aes(long, lat, group = group), fill = \"white\", color = \"black\",\n                               size =0.2),\n                  scale_x_longitude(),\n                  scale_y_latitude(ticks = 10),\n                  coord_quickmap(ylim = c(-55, -20)))\n\n\n\n\n\nShow code\n\n# Download and decompress HadSST data\nhad_file <- here::here(\"_data\", \"hadsst.nc\")\nif (!file.exists(had_file)) {\n  hadsst <- \"https://www.metoffice.gov.uk/hadobs/hadisst/data/HadISST_sst.nc.gz\"\n  had_zip <- tempfile()\n  \n  download.file(hadsst, had_zip, mode = \"wb\")  \n  R.utils::gunzip(had_zip, had_file, remove = FALSE)\n}\n\n\n\n\n\nShow code\n\n# Read data and detrend\nsst <- ReadNetCDF(had_file, \n                   vars = c(\"sst\"),\n                   subset = list(latitude = c(-90, -0),\n                                 time = c(\"1979-01-01\", \"2018-12-31\"))) %>% \n  setnames(c(\"longitude\", \"latitude\"), c(\"lon\", \"lat\")) %>% \n  na.omit() %>% \n  .[, lon := ConvertLongitude(lon)] %>% \n  .[, sst := Detrend(Anomaly(sst)), by = .(lon, lat, month(time))]\n\n\n\n\n\nShow code\n\neofs <- sst[lat %between% c(-55, -20)] %>%\n  copy() %>% \n  .[, sst := sst*sqrt(cos(lat*pi/180))] %>% \n  EOF(sst ~ time | lat + lon, n = 1:2, data = .)\n\n\n\n\n\n\nShow code\n\nggplot(eofs$right, aes(lon, lat)) +\n  geom_contour_fill(aes(z = -sst)) +\n  scale_fill_divergent(guide = \"none\") +\n  quick_map + \n  facet_wrap(PC~., ncol = 1)\n\n\n\n\nFigure 2: Spatial patterns of the frist and second leading EOFs of detrended monthly anomalies of SST between 55°S and 20°S weighted by the square root of the cosine of latitude.\n\n\n\nAnd indeed. The first EOF is kind of ENSO-like (not really full ENSO, because I’m missing the equatorial SSTs, which is where ENSO really shines) and the second EOF looks pretty much identical to the their Figure 1.a save the different prime meridian. The time series associated with the second EOF is also almost exactly the same.\n\n\n\nShow code\n\ncut(eofs, 2) %>% \n  .$left %>%\n  copy() %>% \n  .[, sst5 := frollmean(sst, 5, align = \"center\")] %>% \n  ggplot(aes(time, -sst)) +\n  geom_hline(yintercept = 0, size = 0.2, color = \"gray50\")  +\n  geom_line(aes(y = -sst5))  +\n  geom_line(color = \"gray\") +\n  \n  scale_y_continuous(NULL) +\n  scale_x_datetime(date_breaks = \"5 years\", date_labels = \"%Y\")\n\n\n\n\nFigure 3: Temporal pattern of the second EOF in gray with a 5-month running mean in black.\n\n\n\nOK, I’m on the right track.\nNow, my main concern with this paper is whether this pattern is actually, as the title of the paper says, a global pattern. EOF is a great technique for dimensionality reduction, but it’s too easy to end up with statistical patterns that are a mix of actual physical patterns or even just noise.\nThe authors agree, and they say that..\n\nIn order to examine the synchronization of the W4 pattern among all the basins, point correlation analysis has been performed. For this purpose, eight points [i(37.5°S, 173.5°W), ii(37.5°S, 133.5°W), iii(44.5°S, 90.5°W), iv(39.5°S, 40.5°W), v(29.5°S, 2.5°W), vi(41.5°S, 41.5°E), vii(30.5°S, 86.5°E), viii(35.5°S, 130.5°E)] corresponding to the loading centres are selected (marked by green dots, i-viii, in Fig. 1a). The time series of SST anomaly is computed at each grid point after removing the contributions of the first EOF mode (henceforth, reconstructed SST anomaly). Further, point correlation is performed for the time series at the loading centers (Fig. 1a) with the reconstructed SST anomaly (Fig. 2a–h corresponding respectively to points (i) to (viii) of Fig. 1a).\n\nThe problem, IMHO, is that their Figure 2 doesn’t really show as much synchronisation as they claim. First, let’s reproduce it here.\n\n\nShow code\n\n# Define points of interest\npoints <- tibble::tribble(~lat, ~lon,\n                          -37.5, -173.5,\n                          -37.5, -133.5,\n                          -44.5, -90.5,\n                          -39.5, -40.5, \n                          -29.5, -2.5, \n                          -41.5, 41.5,\n                          -30.5, 86.5,\n                          -35.5, 130.5) %>% \n  as.data.table() %>% \n  .[, lon := ConvertLongitude(lon)] %>% \n  .[, id := tolower(as.roman(seq_len(.N)))] %>% \n  .[, sign := rep(c(-1, 1), 4)]   # sign of original correlation\n\n\n\n\n\nShow code\n\n# Reconstruct SST from leading EOF  and add it to \n# original data                     \nsst_reconstruct <- predict(eofs, n = 1) %>% \n  setnames(\"sst\", \"sst_reconstructed\")\n\nsst <- sst[sst_reconstruct, on = .NATURAL]\nrm(sst_reconstruct)\n\n\n\n\n\nShow code\n\n# Compute correlation maps of  points of interest,\n# both with the orignial sst and sst with filtered EOF1\n# (for compatison)\ncorrs <- sst[points, on = .NATURAL] %>% \n  .[, \":=\"(lon = NULL, lat = NULL)] %>% \n  setnames(c(\"sst\", \"sst_reconstructed\"), c(\"ref\", \"ref_reconstructed\")) %>% \n  .[sst, on = \"time\", allow.cartesian = TRUE] %>% \n  .[, .(correlation = cor(sst, ref),\n        correlation_reconstructed = cor(sst - sst_reconstructed, ref - ref_reconstructed)),\n    by = .(lon, lat, id, sign)]\n\n\n\n\n\n\nShow code\n\ncorrs %>% \n  melt(measure.vars = c(\"correlation\", \"correlation_reconstructed\")) %>% \n  ggplot(aes(lon, lat)) +\n  geom_contour_fill(aes(z = -value*sign), \n                    breaks = AnchorBreaks(anchor = 0, binwidth = 0.1)) +\n  quick_map +\n  geom_point(data = copy(points)[, id := NULL], shape = 21, fill = NA) +\n  geom_point(data = copy(points), shape = 21, color = \"black\", fill =  \"#0e9a83\") +\n  scale_fill_divergent() +\n  facet_grid(id~variable, labeller = labeller(variable = c(correlation = \"SST\", \n                                                           correlation_reconstructed = \"SST - EOF1\")))\n\n\n\n\nFigure 4: Correlation maps of SST and SST with the first EOF filterred out with the corresponding SST at each one of the points of interest. Compare with Figure 2 of Senapati, Dash, and Behera (2021). The sign of the correlation is flipped for the even points as to preserve always the same sign and allow for easier comparison among maps.\n\n\n\nI purposely computed the two versions. The panels on the right should be a reproduction of Senapati, Dash, and Behera (2021)’s Figure 2. It’s hard to compare them because of the different colour palettes and scale limits (the authors chose parameters that enhanced small correlations), but I personally don’t see much coherency. The first three rows do show high correlations between the three points in the Pacific, which in the unfiltered data looks very much like the well-known PSA pattern that appears as a response to El Niño Southern Oscillation.\nAnother way to look at it is with by plotting \\(r^2\\) which directly quantifies the degree of (linear) dependence between points.\n\n\n\nShow code\n\ncorrs %>% \n  ggplot(aes(lon, lat)) +\n  geom_contour_fill(aes(z = correlation_reconstructed^2, \n                        fill = ..level..), breaks = seq(.1, 1, by = 0.1)) +\n  quick_map +\n  geom_point(data = copy(points)[, id := NULL], shape = 21, fill = NA) +\n  geom_point(data = copy(points), shape = 21, color = \"black\", fill =  \"#de3e80\") +\n  scale_fill_viridis_c(oob = scales::squish,\n                       super = ScaleDiscretised) +\n  facet_grid(id~.)\n\n\n\n\nFigure 5: Coefficient of determination (\\(r^2\\)) computed from the correlations with the filtered SST in Figure 4. Contours only show areas with \\(r^2 > 0.1\\).\n\n\n\nAgain, aside from the points in the Pacific, there is not a lot of long-range relationships between points. As I see it, I strongly suspect that this PC2 pattern is not really robustly global.\n\n\nShow code\n\nset.seed(42)\nN <- 500\nrandom_points <- unique(corrs[, .(lon, lat)]) %>% \n  .[sample(.N, N), ] %>% \n  setkey(lon, lat)\n\nrandom_cors <- vapply(seq_len(N), function(i) {\n  r <- random_points[i, ] \n  ref <- sst[lat == r$lat & lon == r$lon, sst - sst_reconstructed]\n  sst[, ref_data := ..ref, by = .(lon, lat)]\n  sst[, .(cor(sst - sst_reconstructed, ref_data)), by = .(lon, lat)] %>% \n    .[, min(V1)]\n}, numeric(1))\n\n\n\nOk, but how could I quantify this vague impression that these maps don’t show a lot of long-range teleconnections? What I’m going to do is to compute 500 correlation maps like Figure 4 but using random points. For each map, I’ll take the absolute value of the minimum (negative) correlation as the level of connectivity.\n\n\n\nShow code\n\ncorrs %>% \n  ggplot(aes(lon, lat)) +\n  geom_contour_fill(aes(z = -correlation_reconstructed*sign), \n                    breaks = AnchorBreaks(anchor = 0, binwidth = 0.1)) +\n  geom_contour2(aes(z = abs(correlation)), breaks = quantile(abs(random_cors), .5), size = 0.25) +\n  quick_map +\n  geom_point(data = copy(points)[, id := NULL], shape = 21, fill = NA) +\n  geom_point(data = copy(points), shape = 21, color = \"black\", fill =  \"#0e9a83\") +\n  scale_fill_divergent() +\n  facet_grid(id~., labeller = labeller(variable = c(correlation = \"SST\", \n                                                           correlation_reconstructed = \"SST - EOF1\")))\n\n\n\n\nFigure 6: Same as Figure 4 but only for the reconstructed SST. Added in black contours, the 0.5 quantile of random correlations derived from 500 correlation maps with random points.\n\n\n\nFigure 6 repeats Figure 4 but it marks the 50th percentile of the minimum correlation values derived from the bootstrap procedure, which is 0.45. 95% of random points had minimum correlations with absolute values larger than 0.66. With this in mind, correlations of the order of \\(\\pm 0.45\\) are not surprising and what would be expected by chance alone. This, of course, is only a crude measure since it doesn’t take into account the size or pattern of the correlations, but I think that it should give some perspective to the real significance to the correlation levels shown here.\nLet’s try something else. From the correlation maps above (and previous knowledge), it’s pretty obvious that the Pacific sector does behave somewhat coherently. So what I’m going to do is to split the spatial pattern into the Pacific basin (between 150°E and 290°E) and the Atlantic-Indian basins (the rest of the hemisphere). Then, I’m going to project each pattern onto the corresponding SST fields to get two indices. If the patterns is really coherent in time, then both indices must be strongly correlated.\n\n\nShow code\n\nseries <- eofs$right %>% copy() %>% \n  .[PC == \"PC2\"] %>% \n  .[, basin := ifelse(lon %between% c(150, 290), \"pacific\", \"atlantic\")] %>% \n  setnames(\"sst\", \"EOF\") %>% \n  .[sst, on = c(\"lon\", \"lat\")] %>% \n  .[, weighted.mean(sst*EOF, cos(lat*pi/180)), by = .(time, basin)]\n\n\n\n\n\nShow code\n\n# Relationship between the two indices. \nseries %>% \n  dcast(time ~ basin, value.var = \"V1\") %>% \n  ggplot(aes(pacific, atlantic)) +\n  geom_point() +\n  geom_label(data = ~.x[, .(cor(pacific, atlantic))], \n            aes(label = paste0(\"cor= \", signif(V1, 2))), \n            x = -0.0035, y = 0.001, size = 7) +\n  geom_smooth(method = \"lm\") +\n  scale_x_continuous(\"Pacific index\") +\n  scale_y_continuous(\"Atlantic-Indian index\")\n\n\n\n\nFigure 7: Relationship between the Pacific index and Atlantic-Indian index.\n\n\n\nI mean… A correlation of 0.44 is not nothing, but it’s also not a lot.\nLet’s do the correlation map of each index. Again, if the pattern is really global, then the correlation map of the Pacific Index should also show th .e Atlantic-Indian pattern and vice versa.\n\n\nShow code\n\npatterns <- eofs$left[PC == \"PC2\"] %>% \n  setnames(c(\"sst\", \"PC\"), c(\"V1\", \"basin\")) %>% \n  rbind(., series, use.names = TRUE) %>% \n  .[sst, on = \"time\", allow.cartesian = TRUE] %>% \n  .[, .(correlation = cor(V1, sst)), by = .(lon, lat, basin)] \n\nlines <- CJ(lon = c(150, 290),\n            basin = c(\"pacific\", \"atlantic\"))\n\n\n\n\n\nShow code\n\npatterns %>% \n  ggplot(aes(lon, lat)) +\n  geom_contour_fill(aes(z = -correlation, fill = ..level..), \n                    breaks = AnchorBreaks()) +\n  quick_map + \n  geom_vline(data = lines, aes(xintercept = lon)) +\n  scale_fill_divergent_discretised(limits = c(-1, 1)) +\n  facet_wrap(basin~., ncol = 1, labeller = labeller(basi = c(pacific = \"Pacific\", \n                                                             atlantic = \"Atlantic-Indian\")))\n\n\n\n\nFigure 8: Correlation patterns with the Pacific index, the Atlantic-Indian index and the PC2.\n\n\n\nAgain… kinda? For the Atlantic-Indian index, the Pacific signal is barely there and it’s actually completely missing in the Western Pacific. And for the Pacific index, the there is some signal in the Indian ocean, but barely any signal in the Atlantic.\nNow one last test. To extend this analysis, I’ll do the same computation but for every longitude. That is, for each longitude, take a 140º wide section of SST centred in that longitude and project the corresponding wave-4 pattern onto it to get a time-varying index. The result, then, is one “local wave-4 index” for each longitude.\n\n\nShow code\n\nlon_width <- diff(c(150, 290))\nlon_halfwidth <- lon_width/2\n\n# \"extended\" version of geopotential height \n# \nsst2 <- eofs$right %>% copy() %>% \n  .[PC == \"PC2\"] %>% \n  setnames(\"sst\", \"EOF\") %>% \n  sst[., on = .NATURAL] %>% \n  ggperiodic::qwrap(lon = c(0, 360) ~ c(-lon_halfwidth, 360 + lon_halfwidth))\n\n# For each longitude, compute EOF using a segment of lon_width width\n# centered in that longitude.\nlon_eofs <- lapply(unique(sst$lon), function(base_lon) {\n  sst2 %>% \n    .[lon %between% (base_lon + c(-lon_halfwidth, lon_halfwidth))] %>% \n    .[, .(eof = weighted.mean(sst*EOF, cos(lat*pi/180))),\n      by = time] %>% \n    .[, base_lon := base_lon] %>% \n    .[]\n}) %>% \n  rbindlist()\n\n\n\n\n\nShow code\n\nk <- lon_eofs %>% \n  widyr::pairwise_cor(base_lon, time, eof) %>% \n  as.data.table() %>% \n  .[, correlation := 1 - abs(correlation)] %>% \n  dcast(item1 ~ item2, value.var = \"correlation\") %>% \n  .[, -1] %>% \n  as.dist() %>% \n  hclust() %>% \n  cutree(3)\n\nsections <- data.table(lon = as.numeric(names(k)), k = k)\ncuts <- sections[c(0, diff(k)) != 0]\n\nlabel_k <- c(\"1\" = \"East Pacific & Atlantic\", \n             \"2\" = \"Indian\",\n             \"3\" = \"West Pacific\")\n\n\ncuts_lon <- LonLabel(cuts$lon)\ncuts_lon_round <- LonLabel(round(cuts$lon/5)*5)\n\n\n\n\n\nShow code\n\nlon_eofs %>% \n  widyr::pairwise_cor(base_lon, time, eof) %>% \n  ggplot(aes(item1, item2)) +\n  geom_contour_fill(aes(z = correlation, fill = ..level..), na.fill = 1) +\n  geom_contour2(aes(z = correlation), size = 0.2) +\n  geom_text_contour(aes(z = correlation, stroke.color = ..level..), color = \"black\",\n                    stroke = 0.2) +\n  scale_fill_divergent(\"Correlation\",\n                       super = ScaleDiscretised) +\n  scale_color_divergent(aesthetics = \"stroke.color\", guide = \"none\") +\n  scale_x_longitude() +\n  scale_y_longitude() +\n  coord_equal() \n\n\n\n\nFigure 9: Pairwise correlation of “local wave-4” indices.\n\n\n\nFigure 9 shows the pairwise correlation between all indices. Correlation drop rapidly with distance, but there are three clearly defined regions of high correlation that could represent various teleconnected areas. Perhaps not coincidentally, they correspond approximately to the three oceanic basins. The Indian between 0º and 120ºE, Western Pacific between 120ºE and 120ºW and Eastern Pacific and Atlantic between 120ºW and 0º.\nBased on these correlations, we use hierarchical clustering with 1 - abs(correlation) as distance measure to classify each longitude into each of 3 groups. The clusters are flanked by the longitudes 17.5°E, 106.5°E, and 120.5°W, which agree well with the visual interpretation of Figure 9. Using this classification, I now create three indices by again projecting the corresponding wave-4 pattern into SST anomalies.\n\n\nShow code\n\nseries_k <- eofs$right %>% copy() %>% \n  .[PC == \"PC2\"] %>% \n  .[sections, on = \"lon\"] %>% \n  setnames(\"sst\", \"EOF\") %>% \n  .[sst, on = c(\"lon\", \"lat\")] %>% \n  .[, .(value = weighted.mean(sst*EOF, cos(lat*pi/180))), by = .(time, k)] %>% \n  .[, value := as.numeric(scale(value)), by = .(k)]\n\n\n\n\n\nShow code\n\npatterns_k <- series_k %>% \n  .[sst, on = \"time\", allow.cartesian = TRUE] %>% \n  .[, .(correlation = cor(value, sst)), by = .(lon, lat, k)] \n\n\n\n\n\n\nShow code\n\npatterns_k %>% \n  ggplot(aes(lon, lat)) +\n  geom_contour_fill(aes(z = -correlation, fill = ..level..), \n                    breaks = AnchorBreaks(0)) +\n  quick_map + \n  geom_raster(data = unique(patterns_k[, .(lon, lat)])[sections, on = \"lon\"],\n              alpha = 0.2) +\n  scale_fill_divergent_discretised(\"Correlation\", limits = c(-1, 1)) +\n  facet_wrap(k~., ncol = 1, labeller = labeller(k = label_k))\n\n\n\n\nFigure 10: Correlation maps between SST and each of the three basin-dependend wave-4 index. Overlayed in gray, the tree distinct areas of shared variability identified in Figure 9 by hierarchical clustering and selecting 3 clusters.\n\n\n\nCorrelation maps between SST anomalies and each of the three indices are shown in Figure 10. Inside the area used to define each index correlation are high and the pattern is well defined, as expected by construction. However, outside those areas, there is very little signal.\n🤷. Take it as you will. From what I’ve seen here, I remain unconvinced that this is a global pattern of SST.\nDownload code\nClick on this button to get the code that generated this document:\n\n\n Download code\n\n\n\n\n\nSenapati, Balaji, Mihir K. Dash, and Swadhin K. Behera. 2021. “Global Wave Number-4 Pattern in the Southern Subtropical Sea Surface Temperature.” Scientific Reports 11 (1): 142. https://doi.org/10.1038/s41598-020-80492-x.\n\n\n\n\n",
    "preview": "posts/2021-01-14-wave4/distill-preview.png",
    "last_modified": "2021-08-10T13:22:43-03:00",
    "input_file": {},
    "preview_width": 960,
    "preview_height": 403
  }
]
