[
  {
    "path": "posts/2021-01-15-sao-and-jet/",
    "title": "The meridional structure of the Semiannual Oscillation",
    "description": "How to filter out extra-tropical variabilty to highlight the structure of the Semiannual Oscillation using just multiple linear regression.",
    "author": [
      {
        "name": "Elio Campitelli",
        "url": "https://eliocamp.github.io/"
      }
    ],
    "date": "2020-01-15",
    "categories": [
      "Semiannual Oscillation",
      "general circulation",
      "tropics",
      "stratosphere"
    ],
    "contents": "\nSome time ago, with a Journal Club I’m part of (shout-out to Go stratospheric!), we read “Representation of the equatorial stratopause semiannual oscillation in global atmospheric reanalyses” (Kawatani et al. 2020), a paper about the Semiannual Oscillation (SAO). One figure (Figure 1) piqued our interest. The SAO is supposed to be a characteristic of the tropical stratosphere and be… you know… semiannual. But in Figure 1, the more sticking feature is extra-tropical and with an annual cycle.\n\n\n\n\nFigure 1: Figure 8 from Kawatani et al. (2020): “Time–latitude sections of climatological mean annual cycle of the zonal mean zonal wind for (a) SABER, (b) MLS, and (c–i) each reanalysis at 1 hPa. The contour intervals are 10 m s−1. Climatology is calculated from 1980 to 2010 in the reanalyses, from 2002 to 2016 in SABER, and from 2005 to 2016 in MLS.”\n\n\n\nWe quickly realised that there’s more going on there than the SAO. Is there a way to filter out the rest of the variability and only look at the SAO-related variabiltiy?\nAs always, first thing first. Download the data and replicate the figure. Kawatani et al. (2020) use data from many many reanalyses, but I’m only going to use data from ERA5.\n\n\n\n\n\n\n\n\n\n\n\n\nFigure 2: Seasonal cycle of zonal mean zonal wind at 1 hPa\n\n\n\nFigure 2 replicated Figure 1 extending the latitude range to the rest of the globe. It becomes even clearer that the main variability is in the extratropics.\nNow, the SAO not only is supposed to be in the tropics, but it’s also restricted to levels higher than ~3 hPa. Figure 3 shows what’s going on at levels bewteen 1 hPa and 30 hPa.\n\n\n\n\nFigure 3: Same as Figure 2 but for multiple levels.\n\n\n\nThe variability in the extratopics is there in the lower levels. So I though, why don’t try to remove that lower-level signal? After looking at Figure 3 and trying around, I settled into representing the lower levels with 5 hPa and 20 hPa.\nSo, at each gridpoint I fit the model\n\\[\nU_{1hPa} = \\alpha U_{5hPa} + \\beta U_{20hPa} + \\epsilon_{1hPa}\n\\]\nWhere \\(U\\) is the zonal mean zonal wind at each level and \\(\\epsilon_{1hPa}\\) is the residual wind that I’m interested in. That is, the variability of zonal mean zonal wind at 1 hPa that is not (linearly) explained by the variability of the zonal mean zonal wind at the lower levels. For those paying attention, this is (I think) essentially removing the equivalent barotropic component in the wind.\n\n\n\nThe seasonal cycle of the residual zonal mean zonal wind in Figure 4 shows that the filtering really works! Now it really looks like the equatorial phenomenon that it’s supposed to be, and the semiannual cycle is plainly for all to see. 🎂.\n\n\n\nFigure 4: Seasonal cycle of the residual zonal mean zonal wind.\n\n\n\nAnd for completitude, Figure 5 shows timeseries of zonal mean zonal wind at the equator, and averaged polarward of 30°. In the equator, the residual zonal wind is virtually identical to the unfiltered zonal wind.\n\n\n\nFigure 5: Timeseries of zonal mean zonal wind and residual zonal wind in the equator, averaged north of 30°N and south of 30°S\n\n\n\nSo the conclusion, I think, is that the meridional structure was a function of the polar jets, and that looking at the SAO by looking at zonal mean zonal wind in the equator is fine.\n\n\n\nKawatani, Yoshio, Toshihiko Hirooka, Kevin Hamilton, Anne K. Smith, and Masatomo Fujiwara. 2020. “Representation of the Equatorial Stratopause Semiannual Oscillation in Global Atmospheric Reanalyses.” Atmospheric Chemistry and Physics 20 (14): 9115–33. https://doi.org/10.5194/acp-20-9115-2020.\n\n\n\n\n",
    "preview": "posts/2021-01-15-sao-and-jet/distill-preview.png",
    "last_modified": "2021-01-15T13:13:24-03:00",
    "input_file": {},
    "preview_width": 1248,
    "preview_height": 768
  },
  {
    "path": "posts/2021-01-14-wave4/",
    "title": "Analysis of \"Global wave number-4 pattern in the southern subtropical sea surface temperature.\"",
    "description": "A recent paper claims to have detected a global wave-4 pattern in subtropical SSTs. But have they really?",
    "author": [
      {
        "name": "Elio Campitelli",
        "url": "https://eliocamp.github.io/"
      }
    ],
    "date": "2020-01-14",
    "categories": [
      "zonal waves",
      "general circulation"
    ],
    "contents": "\nThis are some quick notes on Global wave number-4 pattern in the southern subtropical sea surface temperature (Senapati, Dash, and Behera 2021). The article claims to discover a wave-4 pattern in the southern Sea Surface Temperature (SST). Their basic method is to perform Empirical Orthogonal Function (EOF) to SST between 55°S and 20°S. They discard the first EOF as uninteresting because it’s “ENSO-like” (unsurprising) and focus on the second EOF, whose spatial pattern is in Figure 1.\n\n\n\n\nFigure 1: Panel a from Senapati, Dash, and Behera (2021)’s Figure 1: Spatial pattern of second leading EOF mode of SST anomaly over the region (20°S-55°S) from HadISST.\n\n\n\nFirst things first. Download the data and try to reproduce their figure.\n\nShow code\n# packages\nlibrary(magrittr)\nlibrary(data.table)\nlibrary(metR)\nlibrary(ggplot2)\n\n\n# fast detrend.\nDetrend <- function(y, x) {\n  nas <- is.na(y)\n  m <- mean(y, na.rm = TRUE)\n  if (!hasArg(x)) x <- seq_along(y)\n  y[!nas] <- .lm.fit(cbind(1, x[!nas]), y[!nas])$residuals\n  return(y + m)\n}\n\ntheme_set(theme_minimal() + \n            theme(panel.grid = element_blank()))\n# simple and dirty map\nmap <- ggplot2::map_data(\"world2\") %>%\n  subset(lat %between% c(-90, -0))\n\nquick_map <- list(geom_polygon(data = map,\n                               aes(long, lat, group = group), fill = \"white\", color = \"black\",\n                               size =0.2),\n                  scale_x_longitude(),\n                  scale_y_latitude(ticks = 10),\n                  coord_quickmap(ylim = c(-55, -20)))\n\n\n\n\nShow code\n# Download and decompress HadSST data\nhad_file <- here::here(\"_data\", \"hadsst.nc\")\nif (!file.exists(had_file)) {\n  hadsst <- \"https://www.metoffice.gov.uk/hadobs/hadisst/data/HadISST_sst.nc.gz\"\n  had_zip <- tempfile()\n  \n  download.file(hadsst, had_zip, mode = \"wb\")  \n  R.utils::gunzip(had_zip, had_file, remove = FALSE)\n}\n\n\n\n\nShow code\n# Read data and detrend\nsst <- ReadNetCDF(had_file, \n                   vars = c(\"sst\"),\n                   subset = list(latitude = c(-90, -0),\n                                 time = c(\"1979-01-01\", \"2018-12-31\"))) %>% \n  setnames(c(\"longitude\", \"latitude\"), c(\"lon\", \"lat\")) %>% \n  na.omit() %>% \n  .[, lon := ConvertLongitude(lon)] %>% \n  .[, sst := Detrend(Anomaly(sst)), by = .(lon, lat, month(time))]\n\n\n\n\nShow code\neofs <- sst[lat %between% c(-55, -20)] %>%\n  copy() %>% \n  .[, sst := sst*sqrt(cos(lat*pi/180))] %>% \n  EOF(sst ~ time | lat + lon, n = 1:2, data = .)\n\n\n\n\n\nShow code\nggplot(eofs$right, aes(lon, lat)) +\n  geom_contour_fill(aes(z = -sst)) +\n  scale_fill_divergent(guide = \"none\") +\n  quick_map + \n  facet_wrap(PC~., ncol = 1)\n\n\n\n\nFigure 2: Spatial patterns of the frist and second leading EOFs of detrended monthly anomalies of SST between 55°S and 20°S weighted by the square root of the cosine of latitude.\n\n\n\nAnd indeed. The first EOF is kind of ENSO-like (not really full ENSO, because I’m missing the equatorial SSTs, which is where ENSO really shines) and the second EOF looks pretty much identical to the their Figure 1.a save the different prime meridian. The time series associated with the second EOF is also almost exactly the same.\n\n\nShow code\ncut(eofs, 2) %>% \n  .$left %>%\n  copy() %>% \n  .[, sst5 := frollmean(sst, 5, align = \"center\")] %>% \n  ggplot(aes(time, -sst)) +\n  geom_hline(yintercept = 0, size = 0.2, color = \"gray50\")  +\n  geom_line(aes(y = -sst5))  +\n  geom_line(color = \"gray\") +\n  \n  scale_y_continuous(NULL) +\n  scale_x_datetime(date_breaks = \"5 years\", date_labels = \"%Y\")\n\n\n\n\nFigure 3: Temporal pattern of the second EOF in gray with a 5-month running mean in black.\n\n\n\nOK, I’m on the right track.\nNow, my main concern with this paper is whether this pattern is actually, as the title of the paper says, a global pattern. EOF is a great technique for dimensionality reduction, but it’s too easy to end up with statistical patterns that are a mix of actual physical patterns or even just noise.\nThe authors agree, and they say that..\n\nIn order to examine the synchronization of the W4 pattern among all the basins, point correlation analysis has been performed. For this purpose, eight points [i(37.5°S, 173.5°W), ii(37.5°S, 133.5°W), iii(44.5°S, 90.5°W), iv(39.5°S, 40.5°W), v(29.5°S, 2.5°W), vi(41.5°S, 41.5°E), vii(30.5°S, 86.5°E), viii(35.5°S, 130.5°E)] corresponding to the loading centres are selected (marked by green dots, i-viii, in Fig. 1a). The time series of SST anomaly is computed at each grid point after removing the contributions of the first EOF mode (henceforth, reconstructed SST anomaly). Further, point correlation is performed for the time series at the loading centers (Fig. 1a) with the reconstructed SST anomaly (Fig. 2a–h corresponding respectively to points (i) to (viii) of Fig. 1a).\n\nThe problem, IMHO, is that their Figure 2 doesn’t really show as much synchronisation as they claim. First, let’s reproduce it here.\n\nShow code\n# Define points of interest\npoints <- tibble::tribble(~lat, ~lon,\n                          -37.5, -173.5,\n                          -37.5, -133.5,\n                          -44.5, -90.5,\n                          -39.5, -40.5, \n                          -29.5, -2.5, \n                          -41.5, 41.5,\n                          -30.5, 86.5,\n                          -35.5, 130.5) %>% \n  as.data.table() %>% \n  .[, lon := ConvertLongitude(lon)] %>% \n  .[, id := tolower(as.roman(seq_len(.N)))] %>% \n  .[, sign := rep(c(-1, 1), 4)]   # sign of original correlation\n\n\n\n\nShow code\n# Reconstruct SST from leading EOF  and add it to \n# original data                     \nsst_reconstruct <- predict(eofs, n = 1) %>% \n  setnames(\"sst\", \"sst_reconstructed\")\n\nsst <- sst[sst_reconstruct, on = .NATURAL]\nrm(sst_reconstruct)\n\n\n\n\nShow code\n# Compute correlation maps of  points of interest,\n# both with the orignial sst and sst with filtered EOF1\n# (for compatison)\ncorrs <- sst[points, on = .NATURAL] %>% \n  .[, \":=\"(lon = NULL, lat = NULL)] %>% \n  setnames(c(\"sst\", \"sst_reconstructed\"), c(\"ref\", \"ref_reconstructed\")) %>% \n  .[sst, on = \"time\", allow.cartesian = TRUE] %>% \n  .[, .(correlation = cor(sst, ref),\n        correlation_reconstructed = cor(sst - sst_reconstructed, ref - ref_reconstructed)),\n    by = .(lon, lat, id, sign)]\n\n\n\n\n\nShow code\ncorrs %>% \n  melt(measure.vars = c(\"correlation\", \"correlation_reconstructed\")) %>% \n  ggplot(aes(lon, lat)) +\n  geom_contour_fill(aes(z = -value*sign), \n                    breaks = AnchorBreaks(anchor = 0, binwidth = 0.1)) +\n  quick_map +\n  geom_point(data = copy(points)[, id := NULL], shape = 21, fill = NA) +\n  geom_point(data = copy(points), shape = 21, color = \"black\", fill =  \"#0e9a83\") +\n  scale_fill_divergent() +\n  facet_grid(id~variable, labeller = labeller(variable = c(correlation = \"SST\", \n                                                           correlation_reconstructed = \"SST - EOF1\")))\n\n\n\n\nFigure 4: Correlation maps of SST and SST with the first EOF filterred out with the corresponding SST at each one of the points of interest. Compare withFigure 2 of Senapati, Dash, and Behera (2021).\n\n\n\nI purposedly computed the two versions. The panels on the right should be a reproduction of Senapati, Dash, and Behera (2021)’s Figure 2. It’s hard to compare them because of the different colour palettes and scale limits (the authors really chose the parameters that enhanced small correlations), but I personally don’t see much coherency. The first three rows do show high correlations between the three points in the Pacific, which in the unfiltered data looks very much like the well-known PSA pattern that appears as a response to El Niño Southern Oscillation.\nAnother way to look at it is with by plotting \\(r^2\\) which directly quantifies the degree of (linear) dependence between points.\n\n\nShow code\ncorrs %>% \n  ggplot(aes(lon, lat)) +\n  geom_contour_fill(aes(z = correlation_reconstructed^2, \n                        fill = ..level..), breaks = seq(.1, 1, by = 0.1)) +\n  quick_map +\n  geom_point(data = copy(points)[, id := NULL], shape = 21, fill = NA) +\n  geom_point(data = copy(points), shape = 21, color = \"black\", fill =  \"#de3e80\") +\n  scale_fill_viridis_c(oob = scales::squish,\n                       super = ScaleDiscretised) +\n  facet_grid(id~.)\n\n\n\n\nFigure 5: Coefficient of determination (\\(r^2\\)) computed from the correlations with the filtered SST in Figure 4. Contours only show areas with \\(r^2 > 0.1\\).\n\n\n\nAgain, aside from the points in the Pacific, there is not a lot of long-range relationships between points. As I see it, I strongly suspect that this PC2 pattern is not really robustly global.\nLet’s try something else. From the correlation maps above (and previous knowledge), it’s pretty obvious that the Pacific sector does behave somewhat coherently. So what I’m going to do is to split the spatial pattern into the Pacific basin (between 150°E and 290°E) and the Atlantic-Indian basins (the rest of the hemisphere). Then, I’m going to project each pattern onto the corresponding SST fields to get two indices. If the patterns is really coherent in time, then both indices must be strongly correlated.\n\nShow code\nseries <- eofs$right %>% copy() %>% \n  .[PC == \"PC2\"] %>% \n  .[, basin := ifelse(lon %between% c(150, 290), \"pacific\", \"atlantic\")] %>% \n  setnames(\"sst\", \"EOF\") %>% \n  .[sst, on = c(\"lon\", \"lat\")] %>% \n  .[, cor(sst, EOF), by = .(time, basin)]\n\n\n\n\nShow code\n# Relationship between the two indices. \nseries %>% \n  dcast(time ~ basin) %>% \n  ggplot(aes(pacific, atlantic)) +\n  geom_point() +\n  geom_label(data = ~.x[, .(cor(pacific, atlantic))], \n            aes(label = paste0(\"cor= \", signif(V1, 2))), \n            x = -0.6, y = .5, size = 7) +\n  geom_smooth(method = \"lm\") +\n  scale_x_continuous(\"Pacific index\") +\n  scale_y_continuous(\"Atlantic-Indian index\")\n\n\n\n\nFigure 6: Relationship between the Pacific index and Atlantic-Indian index.\n\n\n\nI mean… A correlation of 0.37 is not nothing, but it’s also not a lot.\nNow one last test. Let’s do the correlation map of each index. Again, if the pattern is really global, then the correlation map of the Pacific Index should also show the Atlantic-Indian pattern and vice versa.\n\nShow code\npatterns <- eofs$left[PC == \"PC2\"] %>% \n  setnames(c(\"sst\", \"PC\"), c(\"V1\", \"basin\")) %>% \n  rbind(., series, use.names = TRUE) %>% \n  .[sst, on = \"time\", allow.cartesian = TRUE] %>% \n  .[, .(correlation = cor(V1, sst)), by = .(lon, lat, basin)] \n\nlines <- CJ(lon = c(150, 290),\n            basin = c(\"pacific\", \"atlantic\"))\n\n\n\n\nShow code\npatterns %>% \n  ggplot(aes(lon, lat)) +\n  geom_contour_fill(aes(z = -correlation, fill = ..level..), \n                    breaks = AnchorBreaks()) +\n  quick_map + \n  geom_vline(data = lines, aes(xintercept = lon)) +\n  scale_fill_divergent_discretised(limits = c(-1, 1)) +\n  facet_wrap(basin~., ncol = 1, labeller = labeller(basi = c(pacific = \"Pacific\", \n                                                             atlantic = \"Atlantic-Indian\")))\n\n\n\n\nFigure 7: Correlation patterns with the Pacific index, the Atlantic-Indian index and the PC2.\n\n\n\nAgain… kinda? For the Atlantic-Indian index, the Pacific signal is barely there and it’s actually completely missing in the Western Pacific. And for the Pacific index, the there is some signal in the Indian ocean, but barely any signal in the Atlantic.\n🤷. Take it as you will. From what I’ve seen here, I remain unconvinced that this is a global pattern of SST.\n\n\n\nSenapati, Balaji, Mihir K. Dash, and Swadhin K. Behera. 2021. “Global Wave Number-4 Pattern in the Southern Subtropical Sea Surface Temperature.” Scientific Reports 11 (1): 142. https://doi.org/10.1038/s41598-020-80492-x.\n\n\n\n\n",
    "preview": "posts/2021-01-14-wave4/distill-preview.png",
    "last_modified": "2021-01-15T13:05:04-03:00",
    "input_file": {},
    "preview_width": 960,
    "preview_height": 403
  }
]
